In [4]:
import pandas as pd

# 1. Extract Data

## 1.1 Extract Data Transactions

In [5]:
df_transactions = pd.read_csv('C:/Users/ASUS/de_zahra-putri/capstone/Data Dummy Greeve - Transactions.csv')
# df_transactions = pd.read_csv('C:/Users/ASUS/de_zahra-putri/capstone/Data Dummy Greeve - Transactions.csv', skiprows=4)
df_transactions.head(2)

,transactions_id,user_id,voucher_id,address,description,status_transactions,total,date,created_at,updated_at,deleted_at,coin dipakai di transaksi
0,7af9d694-63bf-42cd-9afc-8b00716a0083,5dcdb121-85df-487c-8d4a-b4fd5033c9c0,2e419999-cb91-4e36-a363-289976b7e83b,"Jl. Sudirman No. 123, Jakarta",deskripsi 1,Berhasil,105000,2024-06-06 8:59:59,2024-06-01 16:00:00,NaN,NaN,0
1,3b7e3cde-a4ff-4be5-a583-f76bcc3fdf77,5b9a23e5-e562-4fae-b11c-787e655a67d7,2e419999-cb91-4e36-a363-289976b7e83b,"Jl. Gajah Mada No. 456, Surabaya",deskripsi 2,Berhasil,70000,2024-06-12 19:59:59,2024-06-01 16:00:00,NaN,NaN,0

## 1.2 Extract Data Users

In [6]:
df_users = pd.read_csv('C:/Users/ASUS/de_zahra-putri/capstone/Data Dummy Greeve - Users.csv')
df_users.head(2)

,user_id,username,password,name,email,Address,gender,phone,exp,coin,avatar_url,created_at,deleted_at
0,5dcdb121-85df-487c-8d4a-b4fd5033c9c0,oscar.simanjuntak,secret123,Oscar Simanjuntak,oscar.simanjuntak@example.com,"Jl. Kamboja No. 15, Jayapura",Laki-laki,81234567804,350,140,https://storage.googleapis.com/alterra-greeve/...,2024-06-01 16:00:00,NaN
1,5b9a23e5-e562-4fae-b11c-787e655a67d7,ahmad.fauzi,password123,Ahmad Fauzi,ahmad.fauzi@example.com,"Jl. Merdeka No. 1, Jakarta",Laki-laki,81234567890,200,129,https://storage.googleapis.com/alterra-greeve/...,2024-06-01 16:00:00,NaN

## 1.3 Extract Data Impact Categories

In [7]:
df_impact_categories = pd.read_csv('C:/Users/ASUS/de_zahra-putri/capstone/Data Dummy Greeve - Impact Categories.csv')
df_impact_categories.head(2)

,impact_categories_id,name,impact_point,icon_url,created_at,updated_at,deleted_at
0,a8089bc1-de1c-4eaf-a1fd-a2a6bc3028e2,Berkelanjutan,50,NaN,2024-06-01 16:00:00,NaN,NaN
1,1350c308-05e7-4d49-a5ad-3e92b00ecba9,Ramah Lingkungan,40,NaN,2024-06-01 16:00:00,NaN,NaN

## 1.4 Extract Data Products

In [8]:
df_products = pd.read_csv('C:/Users/ASUS/de_zahra-putri/capstone/Data Dummy Greeve - Products.csv')
df_products.head(2)

,products_id,name,description,coin,price,product_image,impact_categories_id,created_at,updated_at,deleted_at
0,7dcf0f20-d1c6-4d8a-8cf5-de60f5c420be,Sedotan yang Dapat Digunakan Kembali,Satu set sedotan stainless steel dengan sikat ...,5,15000,"""https://storage.googleapis.com/alterra-greeve...","""3ecbf571-79b6-452b-8626-c45e1a2ab671""",2024-06-01 16:00:00,NaN,NaN
1,7fbf0a60-57bf-419f-900a-a993d3168cec,Tas Katun Organik,Tas ramah lingkungan yang terbuat dari 100% ka...,10,45000,"""https://storage.googleapis.com/alterra-greeve...","""2d9c8fd2-8104-470f-a8d3-4ff34993fabd"", ""3ecbf...",2024-06-01 16:00:00,NaN,NaN

## 1.5 Extract Data Voucher

In [9]:
df_voucher = pd.read_csv('C:/Users/ASUS/de_zahra-putri/capstone/Data Dummy Greeve - Voucher.csv')
df_voucher.head(2)

,voucher_id,name,code,discount,description,expired_at,created_at,update_at,deleted_at
0,84c65b94-163f-4880-badd-ad10ff8bfead,Natal Ceria,NATAL2024,20000,Diskon khusus untuk produk ramah lingkungan,2024-12-25 23:59:59,2024-06-01 16:00:00,NaN,NaN
1,f1098036-cfa6-48ae-882c-00726d0c5d57,Super Bundle Lebaran,PAKETLEBARAN,15%,Paket penawaran barang-barang ramah lingkungan...,2025-05-15 23:59:59,2024-06-01 16:00:00,NaN,NaN

In [10]:
df_transactions_items = pd.read_csv('C:/Users/ASUS/de_zahra-putri/capstone/Data Dummy Greeve - Transaction_Items.csv')
df_transactions_items.head(2)

,transactions_items_id,transactions_id,products_id,qty,created_at,updated_at,deleted_at
0,ec4de6df-a5a4-412b-ac92-02eac50a13f6,7af9d694-63bf-42cd-9afc-8b00716a0083,7dcf0f20-d1c6-4d8a-8cf5-de60f5c420be,1,2024-06-01 16:00:00,NaN,NaN
1,d3e0425d-e597-4448-8016-53c4dd88c6ee,7af9d694-63bf-42cd-9afc-8b00716a0083,7fbf0a60-57bf-419f-900a-a993d3168cec,2,2024-06-01 16:00:00,NaN,NaN

In [11]:
df_list = [df_transactions, df_users, df_impact_categories, df_products, df_voucher, df_transactions_items]

In [12]:
df_kolom_transactions = df_transactions[["transactions_id", "user_id", "voucher_id", "address", "status_transactions", "total", "date"]]
df_kolom_users = df_users[["user_id", "username", "name", "email", "Address", "gender", "exp", "coin"]]
df_kolom_impact_categories = df_impact_categories[["impact_categories_id", "name", "impact_point"]]
df_kolom_products = df_products[["products_id", "name", "coin", "price", "impact_categories_id"]]
df_kolom_voucher = df_voucher[["voucher_id", "name", "code", "discount"]]
df_kolom_transactions_items = df_transactions_items[["transactions_items_id", "transactions_id", "products_id", "qty", "created_at", "updated_at", "deleted_at"]]

# 2. Transform

In [13]:
transactions_facts = pd.merge(df_kolom_transactions, df_kolom_users, on="user_id", how = 'left')
transactions_facts = pd.merge(transactions_facts, df_kolom_voucher, on="voucher_id", how = 'left')
transactions_facts = pd.merge(transactions_facts, df_kolom_transactions_items, on="transactions_id", how='left')
transactions_facts = pd.merge(transactions_facts, df_kolom_products, on="products_id", how='left')

In [14]:
transactions_facts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 27 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   transactions_id        25 non-null     object
 1   user_id                25 non-null     object
 2   voucher_id             25 non-null     object
 3   address                25 non-null     object
 4   status_transactions    25 non-null     object
 5   total                  25 non-null     int64
 6   date                   25 non-null     object
 7   username               25 non-null     object
 8   name_x                 25 non-null     object
 9   email                  25 non-null     object
 10  Address                25 non-null     object
 11  gender                 25 non-null     object
 12  exp                    25 non-null     int64
 13  coin_x                 25 non-null     int64
 14  name_y                 25 non-null     object
 15  code                   25 non-null     object
 16  discount               25 non-null     object
 17  transactions_items_id  25 non-null     object
 18  products_id            25 non-null     object
 19  qty                    25 non-null     int64
 20  created_at             25 non-null     object
 21  updated_at             0 non-null      float64
 22  deleted_at             0 non-null      float64
 23  name                   25 non-null     object
 24  coin_y                 25 non-null     int64
 25  price                  25 non-null     int64
 26  impact_categories_id   25 non-null     object
dtypes: float64(2), int64(6), object(19)
memory usage: 5.4+ KB

In [15]:
transactions_facts = transactions_facts.drop(columns=["transactions_items_id", "created_at", "updated_at", 
                                                      "deleted_at", "name", "coin_y"])

In [131]:
transactions_facts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   transactions_id       25 non-null     object
 1   user_id               25 non-null     object
 2   voucher_id            25 non-null     object
 3   products_id           25 non-null     object
 4   qty                   25 non-null     int64
 5   price                 25 non-null     int64
 6   impact_categories_id  25 non-null     object
dtypes: int64(2), object(5)
memory usage: 1.5+ KB

In [132]:
transactions_facts.nunique()

transactions_id         15
user_id                  6
voucher_id               6
products_id             25
qty                      3
price                   21
impact_categories_id    18
dtype: int64

In [133]:
# Fungsi mengecek Missing Values dan Duplicate Data
def check_and_clean_data(df):
    # Cek missing values
    print("Missing values:")
    print(df.isnull().sum())
    
    # Cek duplicate data
    print("\nDuplicate data:")
    print(df[df.duplicated()].shape[0])
    
    # Hapus duplicate data
    df = df.drop_duplicates()
    print("\nData setelah dihapus duplicate:")
    print(df.shape)
    
    return df

In [3]:
transactions_facts = check_and_clean_data(transactions_facts)

NameError: name 'check_and_clean_data' is not defined

In [2]:
transactions_facts

NameError: name 'transactions_facts' is not defined